In [1]:
import pandas as pd
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("C:\\Users\\Shuddhamati\\Desktop\\recommendation system\\ratings_Electronics.csv")

In [5]:
df.columns=["user_id","prod_id","rating","timestamp"]

In [6]:
df.head()

          user_id     prod_id  rating   timestamp
0  A2CX7LUOHB2NDG  0321732944     5.0  1341100800
1  A2NWSAGRHCP8N5  0439886341     1.0  1367193600
2  A2WNBOD3WNDNKT  0439886341     3.0  1374451200
3  A1GI0U4ZRJA8WN  0439886341     1.0  1334707200
4  A1QGNMC6O1VW39  0511189877     5.0  1397433600

In [7]:
df.drop('timestamp',axis=1,inplace=True)

In [8]:
df.head()

          user_id     prod_id  rating
0  A2CX7LUOHB2NDG  0321732944     5.0
1  A2NWSAGRHCP8N5  0439886341     1.0
2  A2WNBOD3WNDNKT  0439886341     3.0
3  A1GI0U4ZRJA8WN  0439886341     1.0
4  A1QGNMC6O1VW39  0511189877     5.0

Criteria used for popularity based recommendations :
1.Products with highest rating 
2.Number of buyers

Average rating of Product

In [10]:
df.groupby('prod_id')['rating'].mean().head()

prod_id
0321732944    5.000000
0439886341    1.666667
0511189877    4.500000
0528881469    2.851852
0558835155    3.000000
Name: rating, dtype: float64

In [13]:
df.groupby('prod_id')['rating'].mean().head(25).sort_values(ascending=False)

prod_id
0321732944    5.000000
0594511488    5.000000
0594450705    5.000000
059400232X    5.000000
0594450209    5.000000
0594287995    5.000000
0594033934    5.000000
0594477670    4.666667
0594296420    4.666667
0594033926    4.533333
0594514681    4.500000
0511189877    4.500000
0594033896    4.400000
0594481902    4.384615
0594451647    4.357143
0594481813    4.225806
0594478162    4.000000
0594482127    4.000000
0594202442    4.000000
0594017580    3.000000
0558835155    3.000000
0528881469    2.851852
0594012015    2.000000
0439886341    1.666667
0594017343    1.000000
Name: rating, dtype: float64

Rating Count

In [18]:
df.groupby('prod_id')['rating'].count().head().sort_values(ascending=False)

prod_id
0528881469    27
0511189877     6
0439886341     3
0321732944     1
0558835155     1
Name: rating, dtype: int64

adding average rating count to the table

In [19]:
df[['prod_id','rating']]

            prod_id  rating
0        0321732944     5.0
1        0439886341     1.0
2        0439886341     3.0
3        0439886341     1.0
4        0511189877     5.0
...             ...     ...
7824476  BT008UKTMW     5.0
7824477  BT008UKTMW     5.0
7824478  BT008UKTMW     4.0
7824479  BT008UKTMW     4.0
7824480  BT008V9J9U     5.0

[7824481 rows x 2 columns]

In [20]:
rating_mean_count=pd.DataFrame(df.groupby('prod_id')['rating'].mean())

In [22]:
rating_mean_count.head()

              rating
prod_id
0321732944  5.000000
0439886341  1.666667
0511189877  4.500000
0528881469  2.851852
0558835155  3.000000

Calculating count of rating and add to average rating above

In [23]:
rating_mean_count['rating_counts']=pd.DataFrame(df.groupby('prod_id')['rating'].count())

In [24]:
rating_mean_count.head()

              rating  rating_counts
prod_id
0321732944  5.000000              1
0439886341  1.666667              3
0511189877  4.500000              6
0528881469  2.851852             27
0558835155  3.000000              1

In [25]:
#ROunding off

In [26]:
rating_mean_count['rating']=round(rating_mean_count['rating'],1)

In [27]:
rating_mean_count.head()

            rating  rating_counts
prod_id
0321732944     5.0              1
0439886341     1.7              3
0511189877     4.5              6
0528881469     2.9             27
0558835155     3.0              1

In [28]:
rating_mean_count=rating_mean_count[(rating_mean_count['rating']>3) & (rating_mean_count['rating_counts']>50)]

In [33]:
rating_mean_count.head()

            rating  rating_counts
prod_id
0972683275     4.5           1051
1400501466     3.6            250
1400501520     4.2             82
1400501776     3.9            139
1400532620     3.7            171

In [34]:
rating_mean_count=rating_mean_count.sort_values(by='rating',ascending=False).head(10)
rating_mean_count.head()

            rating  rating_counts
prod_id
B004I763AW     5.0             60
B0043ZLFXE     5.0             90
B002E6R7NG     5.0             51
B008I6RVZU     5.0            103
B00GMRCAC6     5.0            187

Function to recommend top n products

In [36]:
def top_n_products(rating_mean_count, n, min_interaction):
    
    #Finding products with minimum number of interactions
    recommendations = rating_mean_count[rating_mean_count['rating_counts']>min_interaction]
    
    #Sorting values w.r.t average rating 
    recommendations = recommendations.sort_values('rating',ascending=False)
    
    return recommendations.index[:n]

In [38]:
list(top_n_products(rating_mean_count, 10, 50))

['B004I763AW',
 'B0043ZLFXE',
 'B002E6R7NG',
 'B008I6RVZU',
 'B00GMRCAC6',
 'B000TMFYBO',
 'B003J9QQWU',
 'B002A6G3V2',
 'B004XO8DMG',
 'B0055N2L22']

In [39]:
df.head()

          user_id     prod_id  rating
0  A2CX7LUOHB2NDG  0321732944     5.0
1  A2NWSAGRHCP8N5  0439886341     1.0
2  A2WNBOD3WNDNKT  0439886341     3.0
3  A1GI0U4ZRJA8WN  0439886341     1.0
4  A1QGNMC6O1VW39  0511189877     5.0

In [40]:
#split data into train and test

In [46]:
import random
df_shuffled=df.sample(frac=1,random_state=42)  #frac=1 shuffles all rows

In [47]:
cutoff=int(0.8*len(df_shuffled))

In [48]:
df_train=df.iloc[:cutoff]
df_test=df.iloc[cutoff:]